app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES ('abjkfasf', 'abfjsnfklasnkfasnf', 1, '2025-05-31 03:43:01.645915', '2025-05-31 03:43:01.645915') RETURNING "id"